# Brewfile of meinside@gmail.com
#
# Usage: 
#
# $ brew tap Homebrew/bundle
# $ brew bundle
# 
# last update: 2020.02.06.

######## formulas

# libraries
brew 'coreutils'

# utilities
brew 'ffmpeg'
brew 'gnu-sed'
brew 'htop'
brew 'lnav'
brew 'm-cli'
brew 'mas'	# for Mac App Store
brew 'mobile-shell'
brew 'ngrep'
brew 'neovim'
brew 'pstree'
brew 'reattach-to-user-namespace'	# for using pbcopy, pbpaste, or mas in tmux
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh-syntax-highlighting'

# programming language: dart/flutter
tap 'dart-lang/dart'
brew 'dart'

# programming language: clojure
brew 'leiningen'
brew 'borkdude/brew/clj-kondo'
brew 'candid82/brew/joker'
brew 'clojure'

# programming language: go
brew 'go'

# programming language: node
brew 'node'

# programming language: rust
brew 'rustup-init'

# development tools
brew 'curl'
brew 'git'
brew 'git-flow'
brew 'gnupg'
brew 'imagemagick'
brew 'jq'
brew 'mkcert'
brew 'opencv'
brew 'wireshark'
brew 'wrk'

# for docker (install Docker Desktop from https://download.docker.com/mac/stable/Docker.dmg)
brew 'kubernetes-helm'
tap 'wagoodman/dive'
brew 'dive'


######## casks

# utilities
cask 'dropbox'
cask 'google-chrome'
cask 'osxfuse'
#cask 'virtualbox'
cask 'visual-studio-code'
cask 'xquartz'

# for development
cask 'iterm2'
cask 'java'
#cask 'postico'
#cask 'sequel-pro'

# fonts
tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-fira-code'
cask 'font-jetbrains-mono'

