# Brewfile of meinside@duck.com
#
# Usage: 
#
# $ brew tap Homebrew/bundle
# $ brew bundle
# 
# last update: 2022.07.29.

######## formulas

# libraries
brew 'coreutils'

# utilities
brew 'ffmpeg'
brew 'gnu-sed'
brew 'htop'
brew 'lnav'
brew 'm-cli'
brew 'mas'	# for Mac App Store
brew 'mosh', args: ['HEAD']
brew 'ngrep'
brew 'neovim', args: ['HEAD']
brew 'pstree'
brew 'reattach-to-user-namespace'	# for using `pbcopy`, `pbpaste`, or `mas` in tmux
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh-syntax-highlighting'

# for dart/flutter
tap 'dart-lang/dart'
brew 'dart'

# for fennel (use `bin/install_fennel.sh`)
brew 'fennel'

# for haskell (use `bin/install_haskell.sh`)

# other development tools
brew 'curl'
brew 'git'
brew 'git-flow'
brew 'gnupg'
brew 'jq'
brew 'mkcert'
#brew 'wireshark'
#brew 'wrk'
#brew 'vale' # (use `bin/install_vale.sh`)


######## casks

# utilities
cask 'dropbox'
cask 'google-chrome'
cask 'osxfuse'
cask 'visual-studio-code'
cask 'xquartz'
cask 'iterm2'

