# .config/homebrew/Brewfile
#
# Usage:
#
# $ brew tap Homebrew/bundle
# $ brew bundle --file=$XDG_CONFIG_HOME/homebrew/Brewfile
#
# last update: 2026.05.06.

cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

######## formulas

# libraries
brew 'coreutils'

# utilities
brew 'asciinema'
brew 'd2'
brew 'ffmpeg'
#brew 'fish' # for oh-my-fish: $ curl https://raw.githubusercontent.com/oh-my-fish/oh-my-fish/master/bin/install | fish
#brew 'fisher'
brew 'gnu-sed'
brew 'htop'
brew 'lnav'
#brew 'm-cli'
brew 'mas'	# for Mac App Store
brew 'mosh', args: ['HEAD']
brew 'ngrep'
brew 'neovim'
brew 'pstree'
brew 'reattach-to-user-namespace'	# for using `pbcopy`, `pbpaste`, or `mas` in tmux
brew 'starship'
brew 'stats'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh-syntax-highlighting'

# tools for development
brew 'curl'
brew 'git'
brew 'git-flow'
brew 'gnupg'
brew 'jq'
brew 'lazygit'
brew 'mkcert'
#brew 'wireshark'
brew 'witr'
#brew 'wrk'

# tools for cleaning
brew 'mole'

######## casks
#
# utilities
#cask 'android-commandlinetools'
#cask 'android-platform-tools'
cask 'applite'
cask 'dropbox'
cask 'firefox'
cask 'ghostty'
#cask 'halloy'
cask 'input-source-pro'
#cask 'minizincide'
cask 'netnewswire'
#cask 'openscad@snapshot'
cask 'stability-matrix'
cask 'tor-browser'
